**MAESTRÍA EN INTELIGENCIA ARTIFICIAL APLICADA**

**Curso: TC4029 - Ciencia y analítica de datos**

Tecnológico de Monterrey

Prof Grettel Barceló Alonso

**Semana 3**
Bases, almacenes y manipulación de datos

---

*   NOMBRE: Andrea Sánchez Martínez
*   MATRÍCULA: A01795414

---

En esta actividad usarás la base de datos relacional `classicmodels` (MySQL), compuesta por las siguientes tablas:

*   `Customers`: almacena los datos de los clientes.
*   `Products`: almacena una lista de modelos de coches a escala.
*   `ProductLines`: almacena una lista de categorías de líneas de productos.
*   `Orders`: almacena los pedidos de venta realizados por los clientes.
*   `OrderDetails`: almacena elementos de línea de pedidos de ventas para cada pedido de ventas.
*   `Payments`: almacena los pagos realizados por los clientes en función de sus cuentas.
*   `Employees`: almacena toda la información de los empleados, así como la estructura de la organización, como quién informa a quién.
*   `Offices`: almacena los datos de la oficina de ventas.

Revisa con detalle su esquema para que comprendas cómo se relacionan las tablas anteriores.

Recuerda que:


*   Una **clave primaria** es un atributo (o conjunto) que identifica unívocamente a cada registro en la tabla.
*   Una **clave foránea** (externa o ajena) es un atributos (o conjunto) en una tabla que es una clave primaria en otra (o posiblemente la misma) tabla.
*   Las **relaciones** son las líneas que conectan una tabla con otra y el extremo determina la cardinalidad. Las relaciones con línea continua (identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser foránea y primaria (al mismo tiempo) de otra. Las relaciones con línea discontinua (no identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser sólo foránea en otra.

# **Parte 1**. SQLAlchemy y SQL básico

In [1]:
import sqlalchemy as sqla
import pymysql
import pandas as pd

1.	Crea el motor `sqlalchemy`, con el método `create_engine()` y una conexión con `connect()` como se muestra a continuación:

In [2]:
# Crear el motor (dialecto://usuarioBD:clave@ipHostDBMS:puerto/esquema
db = sqla.create_engine('mysql+pymysql://mnaTC4029User:mnaTC4029Pass!@20.106.157.52:3306/classicmodels', pool_recycle=3600)

# Crea una conexión para luego invocar declaraciones SQL
conn = db.connect()

Escribe las consultas en SQL para obtener:

2.	La información de las líneas de productos.

In [3]:
query = sqla.text('SELECT productLine, textDescription FROM productlines') #El resto de la tabla no proporciona información valiosa
pd.read_sql(query, conn)

        productLine                                    textDescription
0      Classic Cars  Attention car enthusiasts: Make your wildest c...
1       Motorcycles  Our motorcycles are state of the art replicas ...
2            Planes  Unique, diecast airplane and helicopter replic...
3             Ships  The perfect holiday or anniversary gift for ex...
4            Trains  Model trains are a rewarding hobby for enthusi...
5  Trucks and Buses  The Truck and Bus models are realistic replica...
6      Vintage Cars  Our Vintage Car models realistically portray a...

3.	Los empleados ordenados por nombre.

In [4]:
query = 'SELECT * FROM employees ORDER BY firstName'
pd.read_sql(query, conn)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
1,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
2,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
3,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
4,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
5,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143.0,Sales Rep
6,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
7,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep
8,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
9,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
10,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
11,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
12,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
13,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102.0,Sales Rep
14,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
15,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep
16,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
17,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
20,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
21,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
22,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep

4.	Los países donde hay oficinas.

In [5]:
query = 'SELECT DISTINCT(country) FROM offices'
pd.read_sql(query, conn)

     country
0        USA
1     France
2      Japan
3  Australia
4         UK

5.	El nombre y teléfono de los clientes de Nueva York (*NYC*).

In [6]:
query = 'SELECT customerName, contactFirstName, phone FROM customers WHERE city = "NYC"'
pd.read_sql(query, conn)

           customerName contactFirstName       phone
0     Land of Toys Inc.             Kwai  2125557818
1    Muscle Machine Inc             Jeff  2125557413
2       Vitachrome Inc.          Michael  2125551500
3  Classic Legends Inc.            Maria  2125558493
4       Microscale Inc.               Yu  2125551957

6.	El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [7]:
query = 'SELECT productCode, productName FROM products WHERE productVendor = "Gearbox Collectibles" AND quantityInStock < 1000'
pd.read_sql(query, conn)

  productCode             productName
0    S18_2581          P-51-D Mustang
1    S18_2795  1928 Mercedes-Benz SSK

7.	Los tres productos más caros, desde el punto de visto de los comercializadores (`buyPrice`).

In [8]:
query = 'SELECT * FROM products ORDER BY buyPrice DESC LIMIT 3'
pd.read_sql(query, conn)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_4962,1962 LanciaA Delta 16V,Classic Cars,1:10,Second Gear Diecast,Features include: Turnable front wheels; steer...,6791,103.42,147.74
1,S18_2238,1998 Chrysler Plymouth Prowler,Classic Cars,1:18,Gearbox Collectibles,Turnable front wheels; steering function; deta...,4724,101.51,163.73
2,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30

8.	La cantidad de productos por línea de producto (no las existencias en inventario)

In [9]:
query = 'SELECT productLine, COUNT(productCode) FROM products GROUP BY productLine'
pd.read_sql(query, conn)

        productLine  COUNT(productCode)
0      Classic Cars                  38
1       Motorcycles                  13
2            Planes                  12
3             Ships                   9
4            Trains                   3
5  Trucks and Buses                  11
6      Vintage Cars                  24

9.	La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [10]:
query = 'SELECT country, COUNT(employeeNumber) FROM employees LEFT JOIN offices USING (officeCode) GROUP BY country'
pd.read_sql(query, conn)

     country  COUNT(employeeNumber)
0  Australia                      4
1     France                      5
2      Japan                      2
3         UK                      2
4        USA                     10

10.	El promedio de los pagos de cada uno de los clientes de España.

In [11]:
query = 'SELECT customerName, AVG(amount) FROM customers LEFT JOIN payments USING(customerNumber) WHERE country = "Spain" GROUP BY customerName'
pd.read_sql(query, conn)

                 customerName   AVG(amount)
0               ANG Resellers           NaN
1         Anton Designs, Ltd.           NaN
2                 CAF Imports  23375.570000
3  Corrida Auto Replicas, Ltd  37480.030000
4          Enaco Distributors  22840.156667
5      Euro+ Shopping Channel  55056.844615
6  Iberia Gift Imports, Corp.  25493.925000

# **Parte 2**. Manipulación de datos con Pandas

11.	Carga las tablas empleadas en dataframes con el mismo nombre y resuelve las consultas anteriores con las funciones de Pandas. Cuida no sobreescribir los dataframes originales al resolver las consultas. Debes obtener los mismos resultados que con SQL.

In [12]:
productlines = pd.read_sql('SELECT * FROM productlines', conn)
products = pd.read_sql('SELECT * FROM products', conn)
orderdetails = pd.read_sql('SELECT * FROM orderdetails', conn)
employees = pd.read_sql('SELECT * FROM employees', conn)
customers = pd.read_sql('SELECT * FROM customers', conn)
orders = pd.read_sql('SELECT * FROM orders', conn)
offices = pd.read_sql('SELECT * FROM offices', conn)
payments = pd.read_sql('SELECT * FROM payments', conn)

2. La información de las líneas de productos.

In [13]:
productlines[["productLine", "textDescription"]] #El resto de la tabla no proporciona información valiosa

        productLine                                    textDescription
0      Classic Cars  Attention car enthusiasts: Make your wildest c...
1       Motorcycles  Our motorcycles are state of the art replicas ...
2            Planes  Unique, diecast airplane and helicopter replic...
3             Ships  The perfect holiday or anniversary gift for ex...
4            Trains  Model trains are a rewarding hobby for enthusi...
5  Trucks and Buses  The Truck and Bus models are realistic replica...
6      Vintage Cars  Our Vintage Car models realistically portray a...

3. Los empleados ordenados por nombre.

In [14]:
employees.sort_values("firstName")

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
10,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
11,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143.0,Sales Rep
13,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
12,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
14,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep

4. Los países donde hay oficinas.

In [15]:
offices["country"].drop_duplicates()

0          USA
3       France
4        Japan
5    Australia
6           UK
Name: country, dtype: object

5. El nombre y teléfono de los clientes de Nueva York (NYC)

In [16]:
customers[customers["city"] == "NYC"][["customerName", "contactFirstName", "phone"]]

             customerName contactFirstName       phone
9       Land of Toys Inc.             Kwai  2125557818
15     Muscle Machine Inc             Jeff  2125557413
27        Vitachrome Inc.          Michael  2125551500
98   Classic Legends Inc.            Maria  2125558493
105       Microscale Inc.               Yu  2125551957

6. El código y nombre de los productos del vendedor Gearbox Collectibles que tengan menos de 1000 unidades en stock.

In [17]:
products[(products["productVendor"] == "Gearbox Collectibles") & (products["quantityInStock"] < 1000)][["productCode", "productName"]]

   productCode             productName
30    S18_2581          P-51-D Mustang
32    S18_2795  1928 Mercedes-Benz SSK

7. Los tres productos más caros, desde el punto de vista de los comercializadores (buyPrice)

In [18]:
products.sort_values("buyPrice", ascending=False)[0:3]

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
5,S10_4962,1962 LanciaA Delta 16V,Classic Cars,1:10,Second Gear Diecast,Features include: Turnable front wheels; steer...,6791,103.42,147.74
25,S18_2238,1998 Chrysler Plymouth Prowler,Classic Cars,1:18,Gearbox Collectibles,Turnable front wheels; steering function; deta...,4724,101.51,163.73
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30

8. La cantidad de productos por línea de producto (no las existencias en inventario)

In [19]:
products[["productLine", "productCode"]].groupby("productLine").count().reset_index()

        productLine  productCode
0      Classic Cars           38
1       Motorcycles           13
2            Planes           12
3             Ships            9
4            Trains            3
5  Trucks and Buses           11
6      Vintage Cars           24

9. La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina)

In [20]:
employees.merge(offices, how= "left", on="officeCode")[["country", "employeeNumber"]].groupby("country").count().reset_index()

     country  employeeNumber
0  Australia               4
1     France               5
2      Japan               2
3         UK               2
4        USA              10

10. El promedio de los pagos de cada uno de los clientes de España.

In [21]:
customers[ customers["country"] == "Spain"].merge(payments, how="left", on="customerNumber")[["customerName", "amount"]].groupby("customerName").mean().reset_index()

                 customerName        amount
0               ANG Resellers           NaN
1         Anton Designs, Ltd.           NaN
2                 CAF Imports  23375.570000
3  Corrida Auto Replicas, Ltd  37480.030000
4          Enaco Distributors  22840.156667
5      Euro+ Shopping Channel  55056.844615
6  Iberia Gift Imports, Corp.  25493.925000

# **Parte 3**. Cliente de Python Firestore

En esta fase te conectarás a una base de datos no relacional de Firestore desde Python. Para ello utilizarás los módulos `credentials` y `firestore` de la biblioteca `firebase_admin`.

In [22]:
import firebase_admin
from firebase_admin import credentials
from firebase_admin import firestore

El archivo `veterinary.json` almacena la clave privada para autenticar una cuenta y autorizar el acceso a los servicios de Firebase. A través de la función `Certificate()`, se regresa una credencial inicializada, que puedes utilizar para crear una nueva instancia de la aplicación. Después de eso, tu conexión a Firestore utilizará las reglas de seguridad establecidas para la base de datos y el usuario autenticado.

In [23]:
cred = credentials.Certificate('veterinary.json') #Descague el archivo localmente y borre las líneas para descargarlo desde Drive
firebase_admin.initialize_app(cred)
db = firestore.client()

12.	Investiga cómo leer la colección `PET_OWNER` y mostrar su contenido en un dataframe. Asegúrate de incluir el id en el resultado

In [24]:
# Fuente: https://code.luasoftware.com/tutorials/pandas/firestore-to-pandas-dataframe
ref = db.collection(u"PET_OWNER")
docs = ref.stream()

items = list(map(lambda x: {**x.to_dict(), 'id': x.id}, docs))

df = pd.DataFrame(items) 
df.set_index('id', inplace=True)
df

,email,key,ownerFirstName,ownerLastName,phone
id,,,,,
0D6yFSs2eu4nYwf2dnQ0,None,NaN,Sam,Taylor,555-454-3465
98357ufgjmWUxjnAuzbz,miles.trent@somewhere.com,NaN,Miles,Trent,None
AFtZincSZxjC4Mcxf9Pf,liz.frier@somewhere.com,NaN,Liz,Frier,555-537-6543
GYDixDwHjMyihjL8TmsM,None,NaN,Jenny,Mayberry,555-454-1243
IpxTuB6FILhwQFcspLws,'marcha.downs@somewhere.com,NaN,Marsha,Downs,555-537-8765
QoXBfS1JdRp6BqgLzaAz,None,NaN,Ken,Roberts,555-454-2354
TTHPxJUVtduW4DXCcs8J,NaN,value,NaN,NaN,NaN
eUtZ44lPRbSHXX04EDp7,nigel.melnik@somewhere.com,NaN,Nigel,Melnik,555-232-5678
n2GG9rlfGOmE0P4TcU0T,richard.james@somewhere.com,NaN,Richard,James,555-537-7654
pDlJlul8EJXO8FBJvFkN,jim.rogers@somewhere.com,NaN,Jim,Rogers,555-232-3456
tAlJ74xQ7tT4TUHwZgmH,mary.keenan@somewhere.com,NaN,Mary,Keenan,555-232-4567

In [25]:
firebase_admin.delete_app(firebase_admin.get_app())